Documents/ЗаявкаНаОбеспечение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявкаНаОбеспечение</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокНаОбеспечение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбеспечиваетсяЗакупкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураСтрокой</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджетов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Протокол</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЗаявокНаОбеспечение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтатусыЗаявокНаОбеспечение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявокНаОбеспечение</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаВыполнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявкаНаОбеспечение/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
// 
// Параметры:
//  МеханизмыДокумента - Массив из Строка - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	
	Возврат;
	
КонецПроцедуры

// Дополнительные источники данных для движений.
// 
// Параметры:
//  ИмяРегистра - Строка - Имя регистра
// 
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение:
//    * Ключ - Строка - Описание
//    * Значение - Строка - Описание
Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт

	ИсточникиДанных = Новый Соответствие;

	Возврат ИсточникиДанных; 

КонецФункции

// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументОбъект.ЗаявкаНаОбеспечение, ДокументСсылка.ЗаявкаНаОбеспечение - ссылка на документ или объект, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//	Структура Из КлючИЗначение - Таблицы проведения:
//			* Ключ - Строка - Имя таблицы
//			* Значение - ТаблицаЗначений - Таблица данных проведения.
//	СписокЗначений Из Строка - список значений, содержащий тексты запросов и их имена.
//						Возвращается в случае, если свойство 'ПолучитьТекстыЗапроса' параметра ДопПараметры
//						имеет значение Истина.
//@skip-check function-return-types -- Структура таблиц динамическая, не описывается
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;

	Если ТипЗнч(Документ) = Тип("ДокументОбъект.ЗаявкаНаОбеспечение") Тогда
		ДокументСсылка = Документ.Ссылка;
	Иначе
		ДокументСсылка = Документ;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("СтатусыПрошедшиеСогласование", 
		Перечисления.СтатусыЗаявокНаОбеспечение.СтатусыПрошедшиеСогласование());
	
	ТекстыЗапроса = Новый СписокЗначений;
	
	//@skip-check constructor-function-return-section
	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции

// Возвращает параметры выбора статей в документе.
//
// Параметры:
//  ОбеспечиваетсяЗакупкой - Булево - Истина, если заявка обеспечивается закупкой
// 
// Возвращаемое значение:
// См. ДоходыИРасходыСервер.ПараметрыВыбораСтатьиИАналитики
//
Функция ПараметрыВыбораСтатейИАналитик(ОбеспечиваетсяЗакупкой) Экспорт
	
	ПараметрыВыбора = ДоходыИРасходыСервер.ПараметрыВыбораСтатьиИАналитики();
	ПараметрыВыбора.ПутьКДанным =    "Объект.Товары";
	ПараметрыВыбора.Статья = "СтатьяРасходов";
	ПараметрыВыбора.ВыборСтатьиРасходов = Истина;
	ПараметрыВыбора.АналитикаРасходов = "АналитикаРасходов";
	
	ПараметрыВыбора.ДоступностьПоОперации = Ложь;
	
	ПараметрыВыбора.ЭлементыФормы.Статья.Добавить("ТоварСтатьяРасходов");
	ПараметрыВыбора.ЭлементыФормы.Статья.Добавить("ТоварыСтатьяРасходов");
	
	ПараметрыВыбора.ЭлементыФормы.АналитикаРасходов.Добавить("ТоварАналитикаРасходов");
	ПараметрыВыбора.ЭлементыФормы.АналитикаРасходов.Добавить("ТоварыАналитикаРасходов");
	
	Возврат ПараметрыВыбора;
	
КонецФункции

#КонецОбласти

#Область СозданиеНаОсновании

// Добавляет команду создания документа "Заявка на обеспечение".
//
// Параметры:
//  КомандыСозданияНаОсновании - ТаблицаЗначений - таблица команд.
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - Добавленная строка таблицы, если команда доступна
//@skip-check function-return-types
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	КомандаСоздатьНаОсновании = Неопределено;
	
	МетаданныеДокумента = Метаданные.Документы.ЗаявкаНаОбеспечение;
	Если ПравоДоступа("Добавление", МетаданныеДокумента) Тогда
		
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = МетаданныеДокумента.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(МетаданныеДокумента);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьЗаявкиНаОбеспечение";
		
	КонецЕсли;
	
	Возврат КомандаСоздатьНаОсновании;
	
КонецФункции

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	КомандыОбеспечения = Новый Массив; // Доступны только в состоянии "На выполнении"
	КомандыЗакупки = Новый Массив; // Доступны только при обеспечении закупкой
	
	// Потребность в обеспечении заказов:
	КомандыОбеспечения.Добавить(Документы.ЗаказНаВнутреннееПотребление.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании));
	
	// Внутренний источник обеспечения:
	КомандыОбеспечения.Добавить(Документы.ЗаказНаПеремещение.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании));
	КомандыОбеспечения.Добавить(Документы.ПеремещениеТоваров.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании));
	КомандыОбеспечения.Добавить(Документы.ВнутреннееПотребление.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании));
	
	// Внешний источник обеспечения:
	КомандыЗакупки.Добавить(Документы.ЗаказПоставщику.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании));
	КомандыЗакупки.Добавить(Документы.ПриобретениеТоваровУслуг.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании));
	КомандыЗакупки.Добавить(Документы.ПриобретениеУслугПрочихАктивов.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании));
	
	// Документы оплаты:
	КомандыЗакупки.Добавить(Документы.ЗаявкаНаРасходованиеДенежныхСредств.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании));
	КомандыЗакупки.Добавить(Документы.СписаниеБезналичныхДенежныхСредств.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании));
	КомандыЗакупки.Добавить(Документы.РасходныйКассовыйОрдер.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании));
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КомандыОбеспечения, КомандыЗакупки);
	
	Для Каждого Команда Из КомандыОбеспечения Цикл
		
		Если Команда = Неопределено Тогда
			Продолжить; // Нет прав на создаваемый объект, команда не создается
		КонецЕсли;
		
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(Команда, "Статус", Перечисления.СтатусыЗаявокНаОбеспечение.НаВыполнении);
	КонецЦикла;
	
	Для Каждого Команда Из КомандыЗакупки Цикл
		
		Если Команда = Неопределено Тогда
			Продолжить; // Нет прав на создаваемый объект, команда не создается 
		КонецЕсли;
		
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(Команда, "ОбеспечиваетсяЗакупкой", Истина);
	КонецЦикла;
	
	ЗаявкаНаОбеспечениеЛокализация.ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры);
	
КонецПроцедуры

#КонецОбласти

#Область Отчеты

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#Область ТекущиеДела

// Заполняет список текущих дел пользователя.
// Параметры:
//   ТекущиеДела - см. ТекущиеДелаСервер.ТекущиеДела.
//
Процедура ПриЗаполненииСпискаТекущихДел(ТекущиеДела) Экспорт
	
	ОбщиеПараметрыЗапросов = ТекущиеДелаСервер.ОбщиеПараметрыЗапросов();
	
	Если Не ПравоДоступа("Редактирование", Метаданные.Документы.ЗаявкаНаОбеспечение)
		Или Не ПолучитьФункциональнуюОпцию("ИспользоватьЗаявкиНаОбеспечение") Тогда
		Возврат;
	КонецЕсли;
	
	Исполнитель = ОбщиеПараметрыЗапросов.Пользователь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЕСТЬNULL(КОЛИЧЕСТВО(ЗаявкаНаОбеспечение.Ссылка), 0) КАК КоличествоЗаявок
	|ИЗ
	|	Документ.ЗаявкаНаОбеспечение КАК ЗаявкаНаОбеспечение
	|ГДЕ
	|	ЗаявкаНаОбеспечение.Исполнитель = &Исполнитель
	|	И НЕ ЗаявкаНаОбеспечение.ПометкаУдаления"; // Черновик тоже требует отработки
	
	Запрос.УстановитьПараметр("Исполнитель", Исполнитель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	КоличествоЗаявокКОбработке = Выборка.КоличествоЗаявок;
	ЕстьДела = ЗначениеЗаполнено(КоличествоЗаявокКОбработке);
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СтруктураБыстрогоОтбора", ОтборЗаявкиКОтработке(Исполнитель));
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", "ЗаявкиКОтработке");
	ПараметрыФормы.Вставить("Отбор", Новый Структура("ПометкаУдаления", Ложь));
		
	ИдентификаторРодителя = "ВнутреннееТовародвижение";
	
	ДелоРодитель = ТекущиеДела.Найти(ИдентификаторРодителя, "Идентификатор");
	Если ДелоРодитель = Неопределено Тогда
		ДелоРодитель = ТекущиеДела.Добавить();
		ДелоРодитель.Идентификатор  = ИдентификаторРодителя;
		ДелоРодитель.Представление  = НСтр("ru = 'Внутреннее товародвижение'");
		ДелоРодитель.Владелец       = Метаданные.Подсистемы.Склад;
	КонецЕсли;
	ДелоРодитель.ЕстьДела = ДелоРодитель.ЕстьДела Или ЕстьДела;
	
	ТекущееДело = ТекущиеДела.Добавить();
	ТекущееДело.Идентификатор = "ДокументыЗаявокНаОбеспечение";
	ТекущееДело.Представление = НСтр("ru = 'Заявки на обеспечение к отработке'");
	ТекущееДело.Количество = КоличествоЗаявокКОбработке;
	ТекущееДело.Форма = "Документ.ЗаявкаНаОбеспечение.ФормаСписка";
	ТекущееДело.ПараметрыФормы = ПараметрыФормы;
	ТекущееДело.Владелец = ИдентификаторРодителя;
	ТекущееДело.ЕстьДела = ЕстьДела;
		
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеПоСтатистике

// Формирует описание реквизитов объекта, заполняемых по статистике их использования.
//
// Параметры:
//  ОписаниеРеквизитов - Структура - описание реквизитов, для которых необходимо получить значения по статистике
//
//
Процедура ЗадатьОписаниеЗаполняемыхРеквизитовПоСтатистике(ОписаниеРеквизитов) Экспорт
	
	Параметры = ЗаполнениеОбъектовПоСтатистике.ПараметрыЗаполняемыхРеквизитов();
	Параметры.РазрезыСбораСтатистики.ИспользоватьВсегда = "Автор";
	Параметры.ЗаполнятьПриУсловии.ПоляОбъектаЗаполнены = "Автор";
	ЗаполнениеОбъектовПоСтатистике.ДобавитьОписаниеЗаполняемыхРеквизитов(ОписаниеРеквизитов,
		"Организация, Подразделение, Склад, Ответственный", Параметры);
	
КонецПроцедуры

#КонецОбласти

#Область ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	Возврат; // Пустой обработчик
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область УправлениеДоступом

// Описание логики ограничения доступа.
// 
// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Склад)
	|	И ЗначениеРазрешено(Подразделение)";

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Параметры получения данных заполнения на основании.
// 
// Возвращаемое значение:
//  Структура - Параметры получения данных заполнения на основании:
// * ПоддерживаетсяРаботаСоСтроками - Булево - В заполняемом документе можно указывать номенклатуру строкой
// * ТипНоменклатуры - Массив Из ПеречислениеСсылка.ТипыНоменклатуры
Функция ПараметрыПолученияДанныхЗаполненияНаОсновании() Экспорт

	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ПоддерживаетсяРаботаСоСтроками", Ложь);
	ВозвращаемоеЗначение.Вставить("ТипНоменклатуры", НоменклатураКлиентСервер.ОтборПоТоваруМногооборотнойТареУслугеРаботе(Ложь));
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает данные для заполнения документа на основании Заявки на обеспечение.
//
// Параметры:
//   Ссылка - ДокументСсылка.ЗаявкаНаОбеспечение - Документ-основание
//   ПараметрыПолучения - См. ПараметрыПолученияДанныхЗаполненияНаОсновании
//
// Возвращаемое значение:
//   Структура:
//     * Шапка - Структура:
//         ** Организация - СправочникСсылка.Организации
//         ** Подразделение - СправочникСсылка.СтруктураПредприятия
//         ** Склад - СправочникСсылка.Склады
//         ** НаправлениеДеятельности - СправочникСсылка.НаправленияДеятельности
//      * Товары - ТаблицаЗначений:
//         ** НоменклатураСтрокой - Строка
//         ** Номенклатура - СправочникСсылка.Номенклатура
//         ** Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры
//         ** Упаковка - СправочникСсылка.УпаковкиЕдиницыИзмерения
//         ** Количество - Число
//         ** КоличествоУпаковок - Число
//         ** Сумма - Число
//         ** СтатьяРасходов - ПланВидовХарактеристикСсылка.СтатьиРасходов
//         ** АналитикаРасходов - Характеристика.СтатьиРасходов
//         ** СтатьяБюджетов - СправочникСсылка.СтатьиБюджетов
//         ** СписатьНаРасходы - Булево
Функция ДанныеЗаполненияНаОсновании(Ссылка, Знач ПараметрыПолучения = Неопределено) Экспорт
	
	Если ПараметрыПолучения = Неопределено Тогда
		ПараметрыПолучения = ПараметрыПолученияДанныхЗаполненияНаОсновании();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Запрос.Параметры, ПараметрыПолучения);
	ТекстыЗапроса = Новый СписокЗначений;
	
	ТекстыЗапроса.Добавить(
		"ВЫБРАТЬ
		|	ЗаявкаНаОбеспечение.Организация             КАК Организация,
		|	ЗаявкаНаОбеспечение.Подразделение           КАК Подразделение,
		|	ЗаявкаНаОбеспечение.Склад                   КАК Склад,
		|	ЗаявкаНаОбеспечение.Валюта                  КАК Валюта,
		|	ЗаявкаНаОбеспечение.НаправлениеДеятельности КАК НаправлениеДеятельности
		|ИЗ
		|	Документ.ЗаявкаНаОбеспечение КАК ЗаявкаНаОбеспечение
		|ГДЕ
		|	ЗаявкаНаОбеспечение.Ссылка = &Ссылка",
		"Шапка");
	
	ТекстыЗапроса.Добавить(
		"ВЫБРАТЬ
		|	ТаблицаТовары.НоменклатураСтрокой КАК НоменклатураСтрокой,
		|	ТаблицаТовары.Номенклатура        КАК Номенклатура,
		|	ТаблицаТовары.Характеристика      КАК Характеристика,
		|	ТаблицаТовары.Упаковка            КАК Упаковка,
		|	ТаблицаТовары.Количество          КАК Количество,
		|	ТаблицаТовары.КоличествоУпаковок  КАК КоличествоУпаковок,
		|	ТаблицаТовары.Сумма               КАК Сумма,
		|	ИСТИНА                            КАК СписатьНаРасходы,
		|	ТаблицаТовары.АналитикаРасходов   КАК АналитикаРасходов,
		|	ТаблицаТовары.СтатьяРасходов      КАК СтатьяРасходов,
		|	Шапка.НаправлениеДеятельности     КАК НаправлениеДеятельности
		|ИЗ
		|	Документ.ЗаявкаНаОбеспечение.Товары КАК ТаблицаТовары
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаОбеспечение КАК Шапка
		|		ПО ТаблицаТовары.Ссылка = Шапка.Ссылка
		|ГДЕ
		|	ТаблицаТовары.Ссылка = &Ссылка
		|	И (ТаблицаТовары.Номенклатура.ТипНоменклатуры В (&ТипНоменклатуры)
		|		ИЛИ ТаблицаТовары.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		| 			И &ПоддерживаетсяРаботаСоСтроками)",
		"Товары");

	РезультатПакета = ОбщегоНазначенияУТ.ПолучитьРезультатыЗапроса(Запрос, ТекстыЗапроса);
	
	РезультатЗапроса = РезультатПакета.Шапка; // РезультатЗапроса
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Шапка = Новый Структура;
	Для Каждого Колонка Из Выборка.Владелец().Колонки Цикл
		Шапка.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);
	КонецЦикла;
	
	Товары = РезультатПакета.Товары.Выгрузить(); // ТаблицаЗначений
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("Шапка", Шапка);
	ВозвращаемоеЗначение.Вставить("Товары", Товары);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает данные, используемые в обработках заполнения платежных документов.
//
// Параметры:
//   Ссылка - ДокументСсылка.ЗаявкаНаОбеспечение - ссылка на документ "Заявка на обеспечение"
//
// Возвращаемое значение:
//   Структура:
//     * РезультатЗапросаШапки - РезультатЗапроса - Данные для шапки документов
Функция ДанныеДляОплаты(Ссылка) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Шапка.Организация                                             КАК Организация,
	|	Шапка.Подразделение                                           КАК Подразделение,
	|	Шапка.СуммаДокумента                                          КАК Сумма,
	|	Шапка.Валюта                                                  КАК Валюта,
	|	Шапка.Валюта                                                  КАК ВалютаВзаиморасчетов,
	|	Шапка.НаправлениеДеятельности                                 КАК НаправлениеДеятельности,
	|	&Ссылка                                                       КАК ДокументОснование,
	|	&Период                                                       КАК ЖелательнаяДатаПлатежа,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщику) КАК ХозяйственнаяОперация,
	|
	|	// Обязательные реквизиты методов ""ЗаполнитьРеквизитыПоРезультатуЗапроса"":
	|	ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)                    КАК Партнер,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)                 КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)        КАК Договор,
	|	ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)  КАК БанковскийСчет,
	|	ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаКонтрагентов.ПустаяСсылка) КАК БанковскийСчетКонтрагента,
	|	ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.ПустаяСсылка)               КАК ФормаОплатыЗаявки,
	|	ЛОЖЬ                                                          КАК ФормаОплатыНаличная,    // Устанавливается в истину, если ФормаОплатыЗаявки не заполнена
	|	ЛОЖЬ                                                          КАК ФормаОплатыБезналичная  // Устанавливается в истину, если ФормаОплатыЗаявки не заполнена
	|ИЗ
	|	Документ.ЗаявкаНаОбеспечение КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	
	РезультатЗапросаШапки = Запрос.Выполнить();
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("РезультатЗапросаШапки", РезультатЗапросаШапки);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Заполняет табличную часть "Расшифровка платежа" платежного документа на основании заявки на обеспечение.
// Параметры:
//  ПлатежныйДокумент - ДокументОбъект.ЗаявкаНаРасходованиеДенежныхСредств, ДокументОбъект.РасходныйКассовыйОрдер, ДокументОбъект.СписаниеБезналичныхДенежныхСредств - Заполняемый документ.
//  ДанныеДляОплаты - См. ДанныеДляОплаты
Процедура ЗаполнитьРасшифровкуПлатежа(ПлатежныйДокумент, ДанныеДляОплаты) Экспорт
	
	// Для заполнения расшифровки не используются данные табличной части, т.к. в них нет информации для разбивки.
	// Переиспользуем данные для заполнения шапки
	Выборка = ДанныеДляОплаты.РезультатЗапросаШапки.Выбрать();
	Выборка.Следующий();
	
	ПлатежныйДокумент.РасшифровкаПлатежа.Очистить();
	СтрокаРасшифровки = ПлатежныйДокумент.РасшифровкаПлатежа.Добавить();
	
	СтрокаРасшифровки.Организация = Выборка.Организация;
	СтрокаРасшифровки.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.СтатьяДвиженияДенежныхСредствПоХозяйственнойОперации(Перечисления.ХозяйственныеОперации.ОплатаПоставщику);
	СтрокаРасшифровки.Сумма = Выборка.Сумма;
	СтрокаРасшифровки.СуммаВзаиморасчетов = Выборка.Сумма;
	СтрокаРасшифровки.ВалютаВзаиморасчетов = Выборка.Валюта;
	
	ПлатежныйДокумент.СуммаДокумента = ПлатежныйДокумент.РасшифровкаПлатежа.Итог("Сумма");
	
КонецПроцедуры

#Область ЛимитыБДР

// Возвращает флаг использования лимитов БДР в заявках на обеспечение.
// 
// Возвращаемое значение:
//  Булево
Функция ИспользоватьЛимитыБДР() Экспорт
	
	ВозвращаемоеЗначение = Ложь;
	
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Определяет необходимость отображения реквизитов закупки в документе.
// 
// Параметры:
//  Объект - ДокументОбъект.ЗаявкаНаОбеспечение, ДанныеФормыСтруктура - Для которого необходимо определить необходимость проверки.
// 
// Возвращаемое значение:
//  Булево
Функция ОтображатьРеквизитыЗакупки(Объект) Экспорт
	
	Возврат Объект.ОбеспечиваетсяЗакупкой
		Или ИспользоватьЛимитыБДР();
	 	
КонецФункции

// Определяет необходимость проверки корректности заполнения реквизитов закупки.
// 
// Параметры:
//  Объект - ДокументОбъект.ЗаявкаНаОбеспечение, ДанныеФормыСтруктура - Для которого необходимо определить необходимость проверки.
// 
// Возвращаемое значение:
//  Булево
Функция ПроверятьРеквизитыЗакупки(Объект) Экспорт
	
	// Если лимиты ведутся, то цены обрабатываются всегда.
	// В остальных случаях они используются только для информации и не контролируются.
	Возврат ПроверятьРеквизитыАналитикЛимитирования(Объект);
	
КонецФункции

// Определяет имена реквизитов, описывающих закупку.
// 
// Возвращаемое значение:
//  Массив из Строка - Имена реквизитов.
//
Функция ИменаРеквизитовЗакупки() Экспорт
	
	ВозвращаемоеЗначение = Новый Массив;
	
	ВозвращаемоеЗначение.Добавить("Валюта");
	
	ВозвращаемоеЗначение.Добавить("Товары.Цена");
	ВозвращаемоеЗначение.Добавить("Товары.Сумма");
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Определяет необходимость проверки корректности заполнения реквизитов аналитик лимитирования.
// 
// Параметры:
//  Объект - ДокументОбъект.ЗаявкаНаОбеспечение, ДанныеФормыСтруктура - Для которого необходимо определить необходимость проверки.
// 
// Возвращаемое значение:
//  Булево
Функция ПроверятьРеквизитыАналитикЛимитирования(Объект) Экспорт
	
	ВозвращаемоеЗначение = Ложь;
	
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Определяет имена реквизитов, которые участвуют в списании лимитов по документу.
// 
// Возвращаемое значение:
//  Массив из Строка - Имена реквизитов.
//
Функция ИменаРеквизитовАналитикЛимитирования() Экспорт
	
	ВозвращаемоеЗначение = Новый Массив;
	
	ВозвращаемоеЗначение.Добавить("Товары.СтатьяБюджетов");
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Определяет имена реквизитов, обязательных для заполнения в шапке документа.
// 
// Возвращаемое значение:
//  Массив из Строка - Имена реквизитов.
//
Функция ИменаРеквизитовШапки() Экспорт
	
	ВозвращаемоеЗначение = Новый Массив;
	
	ВозвращаемоеЗначение.Добавить("Организация");
	ВозвращаемоеЗначение.Добавить("Ответственный");
	ВозвращаемоеЗначение.Добавить("Подразделение");
	ВозвращаемоеЗначение.Добавить("Склад");
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#Область Отборы

Функция ОтборЗаявкиКОтработке(Исполнитель)
	
	ОтборСписка = НовыйОтборСписка();
	ОтборСписка.Исполнитель.Добавить(Исполнитель);
	
	Возврат ОтборСписка;
	
КонецФункции

// Новый отбор списка.
// 
// Возвращаемое значение:
//  Структура - Новый отбор списка:
// * Исполнитель - СписокЗначений Из СправочникСсылка.Пользователи 
// * Ответственный - СписокЗначений Из СправочникСсылка.Пользователи 
// * Статус - СписокЗначений  Из ПеречислениеСсылка.СтатусыЗаявокНаОбеспечение 
// * Автор - СписокЗначений Из СправочникСсылка.Пользователи 
Функция НовыйОтборСписка() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("Исполнитель", Новый СписокЗначений);
	ВозвращаемоеЗначение.Вставить("Ответственный", Новый СписокЗначений);
	ВозвращаемоеЗначение.Вставить("Статус", Новый СписокЗначений);
	ВозвращаемоеЗначение.Вставить("Автор", Новый СписокЗначений);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#Область Проведение

// Пользовательский интерфейс документа упрощен. Режим записи документа определяется по его статусу.
// 
// Параметры:
//  Объект - ДокументОбъект.ЗаявкаНаОбеспечение, ДанныеФормыСтруктура - Для которого необходимо определить режим записи.
// 
// Возвращаемое значение:
//  РежимЗаписиДокумента
Функция РежимЗаписи(Объект) Экспорт
	
	ВозвращаемоеЗначение = РежимЗаписиДокумента.Запись;
	
	ПредыдущееСостояние = Новый Структура;
	ПредыдущееСостояние.Вставить("Проведен", Ложь);
	ПредыдущееСостояние.Вставить("ПометкаУдаления", Ложь);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПредыдущееСостояние = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Объект.Ссылка,
			ОбщегоНазначенияКлиентСервер.КлючиСтруктурыВСтроку(ПредыдущееСостояние));
	КонецЕсли;
	
	Проводить = Перечисления.СтатусыЗаявокНаОбеспечение.Проводить(Объект.Статус);
	
	Если Объект.ПометкаУдаления  
		И Не ПредыдущееСостояние.ПометкаУдаления
		И ПредыдущееСостояние.Проведен Тогда
		
		// Устанавливается пометка удаления у проведенного документа. Отменяем проведение.
		ВозвращаемоеЗначение = РежимЗаписиДокумента.ОтменаПроведения; 
		
	ИначеЕсли Не Проводить И ПредыдущееСостояние.Проведен Тогда
		
		// Установлен статус не требующий проведение.
		ВозвращаемоеЗначение = РежимЗаписиДокумента.ОтменаПроведения;
		
	ИначеЕсли Проводить Тогда
		
		// В том числе для помеченного на удаление (будет вызвано исключение)
		ВозвращаемоеЗначение = РежимЗаписиДокумента.Проведение;
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти


#КонецОбласти

#КонецЕсли
